#Область ОписаниеПеременных

&НаКлиенте
Перем АвторизацияУспешна;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	WSHShell = Новый COMОбъект("WScript.Shell");
	WSHShell.SendKeys("% ");
	WSHShell.SendKeys("{DOWN}{DOWN}{DOWN}{DOWN}{ENTER}");	
	
	АвторизацияУспешна = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если АвторизацияУспешна = Истина Тогда
		Закрыть()
	Иначе
		ЗавершитьРаботуСистемы(Ложь, Ложь)
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Вход(Команда)
	
	Если ЗначениеЗаполнено(Код) И ЗначениеЗаполнено(Пароль) Тогда
		ПарольТекущегоПользователя = НайтиПарольТекущегоПользователя(Код);
		Если ЗначениеЗаполнено(ПарольТекущегоПользователя) Тогда
			Если Пароль = ПарольТекущегоПользователя Тогда
				АвторизацияУспешна = Истина;
				Закрыть();
			Иначе
				Элементы.Ошибка.Заголовок = "Введен неверный пароль"
			КонецЕсли;
		Иначе
			Элементы.Ошибка.Заголовок = "Пользователь не найден"
		КонецЕсли;
	Иначе
		Элементы.Ошибка.Заголовок = "Введите данные"
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть()
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьПароль(Команда)
	
	Если Элементы.Пароль.РежимПароля = Истина Тогда
		Элементы.Пароль.РежимПароля = Ложь;
		Элементы.ПоказатьСкрытьПароль.Картинка = БиблиотекаКартинок.СкрытьПароль
	Иначе
		Элементы.Пароль.РежимПароля = Истина;
		Элементы.ПоказатьСкрытьПароль.Картинка = БиблиотекаКартинок.ПоказатьПароль
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НайтиПарольТекущегоПользователя(Код)
	
	Возврат Справочники.Пользователи.НайтиПоКоду(Код).Пароль
	
КонецФункции

#КонецОбласти